{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/simpel-add-mod",
  "1.21.1":{
	"1.142": "Changes to Crop Growth Recipes, now can have different soils as part of the recipe"
	"1.141": "This removes tinny torches, replaced with just fuel chunks now everything is still the same. adds crop growth block, this is a single block that uses coper to grow your crops/saplings/fungus, will give you 1-3 of the out put.(kind of like Botany pots)",  
	"1.140": "Fixes location of slots inside of tick Accelerator and Crop Harvester gui's. also added the ability to add grow staff to Harvester to change farm land into simpel farmland. fixes chiller block item handler. Grinders now in machines will give you a broken item that can be repaired. right clicking block factory / chiller will now fill  tanks. fixes xp Crystal player uuid lock. broken grinders can be pulled form bottom of machines. can now insert damaged items into the repair tool block and pull out repaired items",  
	"1.139": "Adds armmor and off hand slot to tool repair block. Fixes armor not being able to enchant. Added XP Crystal Storage" , 
	"1.138": "Splitting works better. Removed Grindable tag, now checks recipe to see if its valid. adds AE2 and extended ae mod support. fixes the issue when mekanism not installed the grinder will not work.",  
	"1.137": "Fixes Bug with none chest ontop of Harvester block crashing the game. adds mekanism suport for grinding.",  
	"1.136": "Adds Auto Harvester block. with upgrades it will work a whole farm. also can speed up how fast it goes. will drop items on the ground if a chest is not on top of it. if chest is full it will void items. fixes ores dropping blocks instead of items. fixes bone meal manual grind. manual grinding of emerald/Diamond shard raw to dust craft. Changes Home Crystal to Travel Crystal, it will copy a block you click while shifting",
	"1.135": "fixes home wand, now will let you Teleport between dimensions or will tell you that you are in the wrong one if it cant tp you. Changed the Spawn rate of New ores. Fixes to Gui's bars are now loading correctly. added a burn rate to tick Accelerator",
	"1.134": "Changed the how fast tick Accelerator block eats copper(3min) fixes crop acceleration, redstone will turn it off, when Broken it will drop copper ingots equal to level. Custom swords now only light cow/chicken/pig on fire. added a copper repairing tool Block. nether and end ore's drop more items",  
	"1.133": "Adds Tinny Torches, anyway a button can be placed this will be able to be. changes Netherite shard ore spawning. Adds Nether and End Ores for vanilla. Added the home wand. Added Tick Accelerator block. Fixed Update Checker.",   
	"1.132": "adds speed upgrade 4 really fast working on blocks that use it. adds Fuel Chunks 1 item pre smelt, fixes other fuels in custom furnace blocks, also they check to see if the items burn time is greater then 200",  
	"1.131": "Brings Back JEI. adds Grind Factory block. you can now grind raw ore blocks and get 18 dust. grinding ore blocks now will give you 6 dust and can manual grind them. Adds GrowStaff and Farmland faster growth.",  
	"1.129": "Fixes Fabric Grind Factory shift input for xp Boost slot. clean up code to make process smother and less all over the place. Manual Grind is now shapeless",
	"1.128": "Faster Splitting on multi input blocks, its not perfect but it is better. better codeing for the same blocks",
	"1.126": "Removes Gold Stick, Craftable Blaze rods with gold nuggets and lava. adds Fireproof tool will make you fire proof and harder to burn to death still can. adds feeding tool when health is not max it will give you 6 food, and saturation. adds repair item that will repair 4 Damage on each item every 100 ticks. it will get take damage per item repaired. manual crafting repair of grinder head, repair tool, Fireproof tool and feeding tool will give you more repair than with the anvil now. all things that used the gold stick now use blaze rods.",  
	"1.125": "Adds a Outputs Slot Selector to the Block Factory Block. Small changes to Block Factory Item processing"
  },

  "1.21":{
	"1.132": "adds speed upgrade 4 really fast working on blocks that use it. adds Fuel Chunks 1 item pre smelt, fixes other fuels in custom furnace blocks, also they check to see if the items burn time is greater then 200",  
	"1.131": "Brings Back JEI. you can now grind raw ore blocks and get 18 dust. grinding ore blocks now will give you 6 dust and can manual grind them. Adds GrowStaff and Farmland faster growth.",  
  	"1.129": "Fixes Fabric Grind Factory shift input for xp Boost slot. clean up code to make process smother and less all over the place. Manual Grind is now shapeless",
	"1.128": "Faster Splitting on multi input blocks, its not perfect but it is better. better codeing for the same blocks" , 
	"1.126": "Removes Gold Stick, Craftable Blaze rods with gold nuggets and lava. adds Fireproof tool will make you fire proof and harder to burn to death still can. adds feeding tool when health is not max it will give you 6 food, and saturation. adds repair item that will repair 4 Damage on each item every 100 ticks. it will get take damage per item repaired. manual crafting repair of grinder head, repair tool, Fireproof tool and feeding tool will give you more repair than with the anvil now. all things that used the gold stick now use blaze rods.",  
	"1.125": "Adds a Outputs Slot Selector to the Block Factory Block. Small changes to Block Factory Item processing",
	"1.123": "Fixes the 6x Ore block crafting in the Grind Factory, Makes it so if a non dust item is in the furnace slot it will remove it from bottom. also fixes NeoForge Item Capabilities of all block entitys.",
	"1.122": "Small fixes to furnace upgraded block allows extraction of XP bottles from the sides, Added Grind Factory Block this a combination of Netherite Grinder and Upgraded Furnace block. Added XP Boost upgrade for upgraded Furnace and Grind Factory. Grind Factory also Gives you xp for grinding",
	"1.120": "Fixes Grinder head glitch, adds custom Manual grinder recipes, and new grinder repair recipe using flint.",
	"1.116": "Fixes Armor Not Getting Damaged, also adds new Grinder heads of netherite and Unobtanium, use Smithing table to Upgrade them. adds the Shard Ore to the grinding list to 6X. Grinder Repair Glitch is stuck in 1.21." ,
	"1.115": "Fixes Grinder Block's Crafting.",
	"1.114": "Fixes Lava Buckets in Upgraded Furnace",  
	"1.113": "Fixes Bug with crafting. Also adds 3X ores of Emeralds, Diamonds and Coal",
	"1.112": "Fixes Blocks not dropping or braking. Grind head still doops but i think thats a fabric related bug as other loaders do not doop it.",  
	"1.111": "Fixes Grinder Head Crafting in 1.21, dealing with non stacking item outputting multiple items with craft, also added particle effects and sounds to machines" , 
    "1.110": "Fixes Grinder Head Item Crafting with Fabric, Fixes Item Trims For Chest plates"
  },
  "1.20.4":{
	"1.114": "Fixes Lava Buckets in Upgraded Furnace",
	"1.113": "Adds 3X ores of Emeralds, Diamonds and Coal",
	"1.112": "Fixes infinite Grinder head repair glitch.",  
	"1.111": "Fixes Grinder Head Crafting in 1.21, dealing with non stacking item outputting multiple items with craft, also added particle effects and sounds to machines",  
    "1.110": "Fixes Grinder Head Item Crafting with Fabric, Fixes Item Trims For Chest plates",
	"1.109": "Adds Advancement page, small tweaks to the code and now using MultiModLoader. Added tweaks to the Gui of the upgraded furnace also Hello NeoForge World",
    "1.108": "Fixes Block Braking, small clean up of junk",
    "1.107": "This Fixes a Fabric bug on ore not spawning in end(unobtanium) it is rare but should spawn. this also adds a xp bottle output to the Upgraded furnace. it can store 64 bottles and will bank XP up to 10,000. every 200 will give you a bottle.",
    "1.106": "Fixes Upgraded Furnace to drop, also small changes to GUI",
    "1.105": "Adds a Upgraded Furnace Block, this has 4 slots that will balance from first to last, stores the burn time.",
    "1.103": "Block Factory now has two tanks, lava tank can be inserted into, water tank is only manual. Chiller Block has a water tank also, auto insert works. Upgraded Grinder now splits from first slot down.",
    "1.102": "adds JEI, also adds Upgraded Grinder to JEI",
    "1.102-bata": "!!!NO JEI SO BATA!!! changed time for upgraded Grinder, also fixed an issue with Compacting Draws for Netherite shards"
  },
  "1.20.2":{
	"1.114": "Fixes Lava Buckets in Upgraded Furnace",
	"1.113": "Adds 3X ores of Emeralds, Diamonds and Coal" , 
	"1.112": "Fixes infinite Grinder head repair glitch.",  
	"1.111": "Fixes Grinder Head Crafting in 1.21, dealing with non stacking item outputting multiple items with craft, also added particle effects and sounds to machines",  
    "1.110": "Fixes Grinder Head Item Crafting with Fabric, Fixes Item Trims For Chest plates",
	"1.109": "Adds Advancement page, small tweaks to the code and now using MultiModLoader. Added tweaks to the Gui of the upgraded furnace Also Hello NeoForge World",
    "1.108": "Fixes Block Braking, small clean up of junk",
    "1.107": "This Fixes a Fabric bug on ore not spawning in end(unobtanium) it is rare but should spawn. this also adds a xp bottle output to the Upgraded furnace. it can store 64 bottles and will bank XP up to 10,000. every 200 will give you a bottle.",
    "1.106": "Fixes Upgraded Furnace to drop, also small changes to GUI",
    "1.105": "Adds a Upgraded Furnace Block, this has 4 slots that will balance from first to last, stores the burn time.",
    "1.103": "Block Factory now has two tanks, lava tank can be inserted into, water tank is only manual. Chiller Block has a water tank also, auto insert works. Upgraded Grinder now splits from first slot down.",
    "1.102": "changed time for upgraded Grinder, also fixed an issue with Compacting Draws for Netherite shards",
    "1.101": "added a netherite Grinder with 4x inputs and outputs. also added efficacy upgrade to get more uses out of the grind head, also added overlays for grind uses.",
    "1.099": "fixes some bugs with slots in gui's, also added a speed upgrade for grinder and netherite crafter blocks up to 6x speed.",
    "1.098": "adds end ore, this is an over boosted level of tools and armor for both netherite and obsidirite tools. fixes world gen",
    "1.097": "this changed some code and made things better, also fully working with fabric",
    "1.096": "this fixes a bug with block braking",
    "1.095": "This Brings all the 1.20.1 stuff to 1.20.2, hard coded the grinder block",
    "1.088": "gui Blocks work and fully, updated the way GUI's render there progress or levels. this was done to remove alot of images eating up space",
    "1.086-Bata": "Fixes Blockstate of block factory, Cleans up Grinder Ticks. GUI still down but Directional inputs work and automation is working",
    "1.084-Alpha": "This is Alpha, all manual works but no blocks gui's. can still use the direction and they work"

  },
  
  "1.20.1":{
	"1.136": "Adds Auto Harvester block. with upgrades it will work a whole farm. also can speed up how fast it goes. will drop items on the ground if a chest is not on top of it. if chest is full it will void items.",
	"1.135.B": "Repair Tool Block Gui Fix for copper level",  
	"1.135": "fixes home wand, now will let you Teleport between dimensions or will tell you that you are in the wrong one if it cant tp you. Changed the Spawn rate of New ores. Fixes to Gui's bars are now loading correctly. added a burn rate to tick Accelerator",
	"1.134": "Changed the how fast tick Accelerator block eats copper(3min) fixes crop acceleration, redstone will turn it off, when Broken it will drop copper ingots equal to level. Custom swords now only light cow/chicken/pig on fire. added a copper repairing tool Block. nether and end ore's drop more items",  
	"1.133": "Adds Tinny Torches, anyway a button can be placed this will be able to be. changes Netherite shard ore spawning. Adds Nether and End Ores for vanilla. Added the home wand. Fixed Update Checker.",   
	"1.132": "Fixes Small crafting issues that happened wile updating from newer minecraft. adds speed upgrade 4 really fast working on blocks that use it. adds Fuel Chunks 1 item pre smelt, fixes other fuels in custom furnace blocks, also they check to see if the items burn time is greater then 200",  
	"1.131": "Brings Back JEI. Brings 1.20.1 up to newer versions of the mod. adds Grind Factory block. you can now grind raw ore blocks and get 18 dust. grinding ore blocks now will give you 6 dust and can manual grind them. Adds GrowStaff and Farmland faster growth.",  
	"1.114": "Fixes Lava Buckets in Upgraded Furnace",
	"1.113": "Adds 3X ores of Emeralds, Diamonds and Coal",  
	"1.112": "Fixes infinite Grinder head repair glitch." , 
	"1.111": "Fixes Grinder Head Crafting in 1.21, dealing with non stacking item outputting multiple items with craft, also added particle effects and sounds to machines",  
    "1.110": "Fixes Grinder Head Item Crafting with Fabric, Fixes Item Trims For Chest plates",
	"1.109": "Adds Advancement page, small tweaks to the code and now using MultiModLoader. Added tweaks to the Gui of the upgraded furnace ",
    "1.108": "Fixes Block Braking, small clean up of junk",
    "1.107": "This Fixes a Fabric bug on ore not spawning in end(unobtanium) it is rare but should spawn. this also adds a xp bottle output to the Upgraded furnace. it can store 64 bottles and will bank XP up to 10,000. every 200 will give you a bottle.",
    "1.106": "Fixes Upgraded Furnace to drop, also small changes to GUI",
    "1.105": "Adds a Upgraded Furnace Block, this has 4 slots that will balance from first to last, stores the burn time.",
    "1.103": "Block Factory now has two tanks, lava tank can be inserted into, water tank is only manual. Chiller Block has a water tank also, auto insert works. Upgraded Grinder now splits from first slot down.",
    "1.102": "changed time for upgraded Grinder, also fixed an issue with Compacting Draws for Netherite shards",
    "1.101": "added a netherite Grinder with 4x inputs and outputs. also added efficacy upgrade to get more uses out of the grind head, also added overlays for grind uses.",
    "1.099": "fixes some bugs with slots in gui's, also added a speed upgrade for grinder and netherite crafter blocks up to 6x speed.",
    "1.098": "adds end ore, this is an over boosted level of tools and armor for both netherite and obsidirite tools. fixes world gen",
    "1.097": "This changes some of the code and makes things smoother ",
    "1.096": "this fixes a bug with block braking",
    "1.095": "this adds a Stone sifter block(random output of 6 items), fixes grinderhead not braking in blocks, fixes missing crafting for debrias",
    "1.094": "this fixes bugs with the GUI's for liquid levels. this also makes it so you need Blaze rods in the netherite crafter",
    "1.093": "this adds a netherite Crafting block, this is a one scrap one Gold ingot crafting set up just takes time",
    "1.092": "replaces the Block directional inputs and outputs, more like how they used to be. code overhal.",
    "1.091": "This fixes a bug that i created when adding block progresses. this bug shared the values between blocks this would make it if you had more then one block they would glitch out",
    "1.089": "Adds JEI suprot for the Grinder block, also fixes a bug with Chiller progress bar. also adds JEI tool tips on the Chilling blocks/Items",
    "1.088": "updated the way GUI's render there progress or levels, this was done to reduce space as the mod used alot of files.",
    "1.086": "Fixes BlockFactory BlockState(finally), adds GUI Titles to blocks, also Tool Tips on the inputslots.",
    "1.085": "Fixes bug with Raw Iron in the grinder. tags added for dusts/ingots. added debri ore to the grinder, also made it so only the correct items will go into correct slots of GUI's",
    "1.084": "Adds copper dust, and all process's for it. also added deepslate ore's to the manual process",
    "1.083": "fixes updater links",
    "1.082": "fixes chiller block bucket removal, adds auto update checker.",
    "1.080": "Fixed an issue animation of block and fixes many blocks issues inside of the gui.",
    "1.078": "adds progress bars to all blocks, adds a chiller that gives you 10x ice per bucket of water.",
    "1.075": "Updated grinder block recipes, adding a block factory (cobbleGen kinda block) with 4 x obsidian",
    "1.070": "Added a Grinder block for doubling ores",
    "1.068": "First Release of the mod."
  },
  "promos": {
	"1.21.1-latest": "1.141",
    "1.21.1-recommended": "1.141",
    
	"1.20.1-latest": "1.136",
    "1.20.1-recommended": "1.136",
	
	"1.21-latest": "1.132",
    "1.21-recommended": "1.132",
    "1.20.4-latest": "1.114",
    "1.20.4-recommended": "1.114",
    "1.20.2-latest": "1.114",
    "1.20.2-recommended": "1.114"
    }
}