{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/simpel-add-mod",
  "1.20.2": {
    "1.088": "gui Blocks work and fully, updated the way GUI's render there progress or levels. this was done to remove alot of images eating up space",
    "1.086-Bata": "Fixes Blockstate of block factory, Cleans up Grinder Ticks. GUI still down but Directional inputs work and automation is working",
    "1.084-Alpha": "This is Alpha, all manual works but no blocks gui's. can still use the direction and they work"

  },
  "1.20.1": {
    "1.091": "This fixes a bug that i created when adding block progresses. this bug shared the values between blocks this would make it if you had more then one block they would glitch out",
    "1.089": "Adds JEI suprot for the Grinder block, also fixes a bug with Chiller progress bar. also adds JEI tool tips on the Chilling blocks/Items",
    "1.088": "updated the way GUI's render there progress or levels, this was done to reduce space as the mod used alot of files.",
    "1.086": "Fixes BlockFactory BlockState(finally), adds GUI Titles to blocks, also Tool Tips on the inputslots.",
    "1.085": "Fixes bug with Raw Iron in the grinder. tags added for dusts/ingots. added debri ore to the grinder, also made it so only the correct items will go into correct slots of GUI's",
    "1.084": "Adds copper dust, and all process's for it. also added deepslate ore's to the manual process",
    "1.083": "fixes updater links",
    "1.082": "fixes chiller block bucket removal, adds auto update checker.",
    "1.080": "Fixed an issue animation of block and fixes many blocks issues inside of the gui.",
    "1.078": "adds progress bars to all blocks, adds a chiller that gives you 10x ice per bucket of water.",
    "1.075": "Updated grinder block recipes, adding a block factory (cobbleGen kinda block) with 4 x obsidian",
    "1.070": "Added a Grinder block for doubling ores",
    "1.068": "First Release of the mod."
  },
  "promos": {
    "1.20.2-latest": "1.088",
    "1.20.2-recommended": "1.088",
    "1.20.1-latest": "1.091",
    "1.20.1-recommended": "1.091"

  }
}